#+title: My Doom Emacs Config
#+author: Ahsanur Rahman

This is my personal Doom Emacs configuration, organized in a literate programming style using Org mode. This file is the single source of truth; the actual `config.el` is generated ("tangled") from the source blocks herein.

** DONE Eglot Setup
Enable Eglot automatically in Python buffers, including org-src-mode.
#+begin_src emacs-lisp
(add-hook 'python-mode-hook #'eglot-ensure)
(add-hook 'python-ts-mode-hook #'eglot-ensure)

;; Enable Eglot in org-src-mode buffers for Python
(defun my/org-src-python-eglot-setup ()
  "Enable Eglot in org-src-mode buffers for Python.
This function ensures LSP features work in code blocks edited via org-edit-special."
  (when (and (derived-mode-p 'python-mode 'python-ts-mode)
             (bound-and-true-p org-src-mode)
             (not (eglot-managed-p)))
    ;; Delay to allow org-src-mode to fully initialize
    (run-with-idle-timer 0.3 nil
      (lambda (buf)
        (when (buffer-live-p buf)
          (with-current-buffer buf
            (when (and (derived-mode-p 'python-mode 'python-ts-mode)
                       (not (eglot-managed-p)))
              ;; Eglot requires a file name for project detection
              ;; Create a temporary file path for org-src buffers
              (unless buffer-file-name
                (setq-local buffer-file-name
                           (expand-file-name
                            (format "org-src-python-%s.py" (buffer-name))
                            temporary-file-directory)))
              ;; Start eglot
              (eglot-ensure)))))
      (current-buffer))))

(add-hook 'org-src-mode-hook #'my/org-src-python-eglot-setup)

;; Enable eldoc in org-src-mode for documentation display
(add-hook 'org-src-mode-hook
  (lambda ()
    (when (and (derived-mode-p 'python-mode 'python-ts-mode)
               (eglot-managed-p))
      (eldoc-mode 1))))
#+end_src

#+RESULTS:
| #[nil ((when (and (derived-mode-p 'python-mode 'python-ts-mode) (eglot-managed-p)) (eldoc-mode 1))) nil] | my/org-src-python-eglot-setup | org-src-babel-configure-edit-buffer | org-src-mode-configure-edit-buffer | rainbow-delimiters-mode |

